core/src/main/resources/order_template/addsub_blank.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata">
   <soapenv:Header/>
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{4}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
         <OrderUserId>{5}</OrderUserId>
         <OrderDateTime>{3}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>ADDSUB</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>ACCESS{4}</OrderItemId>
               <OrderItemParentId/>
            </OrderItem>
            <OrderItem>
               <OrderItemType>PLAN</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>PLAN{4}</OrderItemId>
               <OrderItemParentId>ACCESS{4}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>PlanId</Name>
                     <Value>{2}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SIM</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>SIM{4}</OrderItemId>
               <OrderItemParentId>ACCESS{4}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>IMSI</Name>
                     <Value>{0}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>MSISDN{4}</OrderItemId>
               <OrderItemParentId>ACCESS{4}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{1}</Value>
                  </Attribute>
               </Attributes>
               <OrderItemCode/>
            </OrderItem>
         </OrderItems>         
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>